
'''
Параметры для поиска по сайту со списком проектов
================================================================
'''

# Отвечает за количество страниц на сайте со списком проектов
pagination_param = "//ul[@class='pagination']"

# Отвечает за кнопку "next" - для переключения между страницами
next_param = "//li[@class='next']"
type_next = 'li'

# Отвечает за список всех проектов по запросу
table_projects = "//div[@class='Newbuildings__NewBuildingList-sc-1bou0u4-14 huMfny']"

# Отвечает за список ID всех проектов
name_container = "//p[@class='NewBuildingItem__Text-sc-o36w9y-7 NewBuildingItem__ObjectID-sc-o36w9y-8 iUiqkY cgrVoh']"


'''
Параметры для поиска по сайту с конкретным проектом
================================================================
'''

build_info = "//div[@class='Developer__Container-sc-kydjcf-1 hMdDdq']"
  = "//div[@class='Row-sc-13pfgqd-0 dJkQFS']"

house_info = "//div[@class='MainInfo__Wrapper-sc-48mxk2-0 kzbZRn']"
last_declar = "//div[@class='Developer__Decl-sc-kydjcf-0 kBSRPf']"

table_declar = "//div[@class='Table-sc-17it3za-0 jDyEgE']"

button_load_more = "//button[@class='FooterLoadMore__LoadMore-sc-130vmhh-1 jZIBWi']"

declaration_link = "//div[@class='DownloadCell__Wrapper-sc-9x6nxn-2 bABjGz soz-undefined']/a"
declaration_date = "//span[@class='DateCell__Date-sc-10m5x2s-0 jUKvTv']"





'''
Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       
    Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       
Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       Z       
'''





'''
Выгружаемые параметры из деклараций
================================================================
'''
# --------------------------------------------------------------

begin_list = [
                'Уточнение адреса:',
                'Назначение объекта', 
                'Минимальное кол-во этажей:', 
                'Максимальное кол-во этажей:', 
                'Общая площадь объекта:',
                'Материал наружных стен и каркаса объекта:',
                'Материал перекрытий:',
                'Класс энергоэффективности:',
                'Сейсмостойкость:'
            ]

begin_exceptions = [
                        '9.2.16',
                        '9.2.17',
                        '9.2.18',
                        '9.2.19',
                        '9.2.20',
                        '9.2.21',
                        '9.2.22',
                        '9.2.23',
                        '9.2.24'
                    ]

begin_params = {
                '1.1.1':['Организационно-правовая форма:'],
                '1.1.2':['Полное наименование без указания организационно-правовой формы:'],
                '1.1.3':['Краткое наименование без указания организационно-правовой формы:'],
                '1.2.2':['Субъект Российской Федерации:'],
                '1.2.3':['Район Субъекта Российской Федерации:'],
                '1.2.4':['Вид населенного пункта:'],
                '1.2.5':['Наименование населенного пункта:'],
                '4.1.2':['Субъект Российской Федерации:'],
                '4.1.3':['Район субъекта Российской Федерации:'],
                '4.1.4':['Вид населенного пункта:'],
                '4.1.5':['Наименование населенного пункта:'],
                '4.1.6':['Элемент улично-дорожной сети:', 'Элемент дорожно-уличной сети:'],
                '4.1.7':['Наименование элемента улично-дорожной сети:', 'Наименование элемента дорожно-уличной сети:'],
                '4.1.8':['Тип здания (сооружения):'],
                '4.1.9':['Индивидуализирующее объект, группу объектов капитального строительства коммерческое обозначение (при наличии):'],
                '4.1.11':['Дата выдачи разрешения на ввод объекта капитального строительства в эксплуатацию:', 'Дата выдачи разрешения на ввод объекта в эксплуатацию:'],
                '4.1.12':['Номер разрешения на ввод объекта капитального строительства в эксплуатацию:'],
                '6.1.1':['Последняя отчетная дата:'],
                '6.1.2':['Размер чистой прибыли (убытков) по данным промежуточной или годовой бухгалтерской (финансовой) отчетности:'],
                '6.1.3':['Размер кредиторской задолженности по данным промежуточной или годовой бухгалтерской (финансовой) отчетности:', 'Расшифровка размера задолженности:'],
                '6.1.4':['Размер дебиторской задолженности по данным промежуточной или годовой бухгалтерской (финансовой) отчетности:', 'Расшифровка размера задолженности:'],
                '9.4.1':['Общее количество пассажирских лифтов:'],
                '9.4.2':['Общее количество грузовых лифтов (грузоподъемностью не менее 1000 кг):'],
                '9.4.3':['Общее количество грузопассажирских лифтов:'],
                '9.4.4':['Общее количество инвалидных подъемников:'],
                '9.2.16':begin_list,
                '9.2.17':begin_list,
                '9.2.18':begin_list,
                '9.2.19':begin_list,
                '9.2.20':begin_list,
                '9.2.21':begin_list,
                '9.2.22':begin_list,
                '9.2.23':begin_list,
                '9.2.24':begin_list,
                '9.3.1':['Сумма общей площади всех жилых помещений:'],
                '9.3.2':['Сумма общей площади всех нежилых помещений:']
                }

# --------------------------------------------------------------

object_parameters = { 
                        '11.1.1':['Номер разрешения на строительство:'],
                        '11.1.2':['Дата выдачи разрешения на строительство:'],
                        '11.1.3':['Срок действия разрешения на строительство:'],
                        '11.1.4':['Последняя дата продления срока действия разрешения на строительство:'],
                        '12.1.1':['Вид права застройщика на земельный участок:'],
                        '12.3.1':['Кадастровый номер земельного участка:'],
                        '12.3.2':['Площадь земельного участка:'],
                        '15.1.1':['Количество жилых помещений:'],
                        '15.1.2':['Количество нежилых помещений:'],
                        '15.1.2.1':['В том числе машино-мест:'],
                        '15.1.2.2':['В том числе иных нежилых помещений:'],
                        '17.1.1':['Этап реализации проекта строительства:'],
                        '17.1.2':['Планируемый квартал и год выполнения этапа реализации проекта строительства:'],
                        '17.2.2':['Планируемая дата передачи застройщиком объекта долевого строительства:'],
                        '18.1.1':['Планируемая стоимость строительства:'],
                        '19.1.1':['Планируемый способ обеспечения обязательств застройщика по договорам участия в долевом строительстве:'],
                        '19.2.2':['Полное наименование кредитной организации, в которой участниками долевого строительства должны быть открыты счета эскроу, без указания организационноправовой формы:'],
                        '19.6.1.4':['Сумма кредита (займа) в соответствии с условиями договора:', 'Доступная сумма кредита (займа):'],
                        '19.6.1.5':['Сумма задолженности по договору кредита (займа) на последнюю отчетную дату:', 'Лимит кредитования в соответствии с условиями договора кредита (займа):'],
                        '19.6.1.7':['Cрок исполнения обязательств заемщика в полном размере в соответствии с договором кредита (займа):'],
                        '19.7.1.1.1.1':['Количество договоров, заключенных с использованием счетов эскроу:'],
                        '19.7.1.1.1.2':['Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.1.1.1.3':['Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.1.1.2.1':['Количество договоров, заключенных с использованием счетов эскроу:'],
                        '19.7.1.1.2.2':['Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.1.1.2.3':['Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.1.1.3.1':['Количество договоров, заключенных с использованием счетов эскроу:'],
                        '19.7.1.1.3.2':['Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.1.1.3.3':['Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.2.1.1.1':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:'],
                        '19.7.2.1.1.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.2.1.1.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.2.1.2.1':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:'],
                        '19.7.2.1.2.2':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.2.1.2.3':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.2.1.3.1':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:'],
                        '19.7.2.1.3.2':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.2.1.3.3':['Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.3.1.1.1':['Суммарная цена договоров, заключенных с использованием счетов эскроу:'],
                        '19.7.3.1.1.2':['Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.3.1.1.3':['Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.3.1.2.1':['Суммарная цена договоров, заключенных с использованием счетов эскроу:'],
                        '19.7.3.1.2.2':['Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.3.1.2.3':['Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                        '19.7.3.1.3.1':['Суммарная цена договоров, заключенных с использованием счетов эскроу:'],
                        '19.7.3.1.3.2':['Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:'],
                        '19.7.3.1.3.3':['Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:'],
                    }

initial_parameters = {
                        '1.1.1':'Организационно-правовая форма:',
                        '1.1.2':'Полное наименование без указания организационно-правовой формы:',
                        '1.1.3':'Краткое наименование без указания организационно-правовой формы:',
                        '1.2.2':'Субъект Российской Федерации:',
                        '1.2.3':'Район Субъекта Российской Федерации:',
                        '1.2.4':'Вид населенного пункта:',
                        '1.2.5':'Наименование населенного пункта:',
                        '4.1.2':'Субъект Российской Федерации:',
                        '4.1.3':'Район субъекта Российской Федерации:',
                        '4.1.4':'Вид населенного пункта:',
                        '4.1.5':'Наименование населенного пункта:',
                        '4.1.6':'Элемент улично-дорожной сети:',
                        '4.1.7':'Наименование элемента улично-дорожной сети:',
                        '4.1.8':'Тип здания (сооружения):',
                        '4.1.9':'Индивидуализирующее объект, группу объектов капитального строительства коммерческое обозначение (при наличии):',
                        '4.1.11':'Дата выдачи разрешения на ввод объекта капитального строительства в эксплуатацию:',
                        '4.1.12':'Номер разрешения на ввод объекта капитального строительства в эксплуатацию:',
                        '6.1.1':'Последняя отчетная дата:',
                        '6.1.2':'Размер чистой прибыли (убытков) по данным промежуточной или годовой бухгалтерской (финансовой) отчетности:',
                        '6.1.3':'Размер кредиторской задолженности по данным промежуточной или годовой бухгалтерской (финансовой) отчетности:',
                        '6.1.4':'Размер дебиторской задолженности по данным промежуточной или годовой бухгалтерской (финансовой) отчетности:',
                        '9.2.16':'Уточнение адреса:',
                        '9.2.17':'Назначение объекта',
                        '9.2.18':'Минимальное кол-во этажей:',
                        '9.2.19':'Максимальное кол-во этажей:',
                        '9.2.20':'Общая площадь объекта:',
                        '9.2.21':'Материал наружных стен и каркаса объекта:',
                        '9.2.22':'Материал перекрытий:',
                        '9.2.23':'Класс энергоэффективности:',
                        '9.2.24':'Сейсмостойкость:',
                        '9.3.1':'Сумма общей площади всех жилых помещений:',
                        '9.3.2':'Сумма общей площади всех нежилых помещений:',
                        '11.1.1':'Номер разрешения на строительство:',
                        '11.1.2':'Дата выдачи разрешения на строительство:',
                        '11.1.3':'Срок действия разрешения на строительство:',
                        '11.1.4':'Последняя дата продления срока действия разрешения на строительство:',
                        '12.1.1':'Вид права застройщика на земельный участок:',
                        '12.3.1':'Кадастровый номер земельного участка:',
                        '12.3.2':'Площадь земельного участка:',
                        '15.1.1':'Количество жилых помещений:',
                        '15.1.2':'Количество нежилых помещений:',
                        '15.1.2.1':'В том числе машино-мест:',
                        '15.1.2.2':'В том числе иных нежилых помещений:',
                        '17.1.1':'Этап реализации проекта строительства:',
                        '17.1.2':'Планируемый квартал и год выполнения этапа реализации проекта строительства:',
                        '17.2.2':'Планируемая дата передачи застройщиком объекта долевого строительства:',
                        '18.1.1':'Планируемая стоимость строительства:',
                        '19.1.1':'Планируемый способ обеспечения обязательств застройщика по договорам участия в долевом строительстве:',
                        '19.2.2':'Полное наименование кредитной организации, в которой участниками долевого строительства должны быть открыты счета эскроу, без указания организационноправовой формы:',
                        '19.6.1.4':'Сумма кредита (займа) в соответствии с условиями договора:',
                        '19.6.1.5':'Лимит кредитования в соответствии с условиями договора кредита (займа):',
                        '19.6.1.7':'Cрок исполнения обязательств заемщика в полном размере в соответствии с договором кредита (займа):',
                        '19.7.1.1.1.1':'Количество договоров, заключенных с использованием счетов эскроу:',
                        '19.7.1.1.1.2':'Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.1.1.1.3':'Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.1.1.2.1':'Количество договоров, заключенных с использованием счетов эскроу:',
                        '19.7.1.1.2.2':'Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.1.1.2.3':'Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.1.1.3.1':'Количество договоров, заключенных с использованием счетов эскроу:',
                        '19.7.1.1.3.2':'Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.1.1.3.3':'Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.2.1.1.1':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:',
                        '19.7.2.1.1.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.2.1.1.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.2.1.2.1':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:',
                        '19.7.2.1.2.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.2.1.2.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.2.1.3.1':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:',
                        '19.7.2.1.3.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.2.1.3.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.3.1.1.1':'Суммарная цена договоров, заключенных с использованием счетов эскроу:',
                        '19.7.3.1.1.2':'Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.3.1.1.3':'Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.3.1.2.1':'Суммарная цена договоров, заключенных с использованием счетов эскроу:',
                        '19.7.3.1.2.2':'Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.3.1.2.3':'Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                        '19.7.3.1.3.1':'Суммарная цена договоров, заключенных с использованием счетов эскроу:',
                        '19.7.3.1.3.2':'Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                        '19.7.3.1.3.3':'Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                    }

changing_params = {
                        '1.1.1':'firm_form:',
                        '1.1.2':'full_name',
                        '1.1.3':'firm_short_name',
                        '1.2.2':'firm_subject_rf',
                        '1.2.3':'firm_district_rf',
                        '1.2.4':'firm_type_of_city',
                        '1.2.5':'firm_name_of_city',
                        '4.1.2':'project_subject_rf',
                        '4.1.3':'project_district_rf',
                        '4.1.4':'project_type_of_city',
                        '4.1.5':'project_name_of_city',
                        '4.1.6':'street_element',
                        '4.1.7':'street_element_name',
                        '4.1.8':'building_type',
                        '4.1.9':'commercial_designation',
                        '4.1.11':'date_issue_permit_capital_construction',
                        '4.1.12':'number_issue_permiit_capital_construction',
                        '6.1.1':'last_report_date',
                        '6.1.2':'net_profit',
                        '6.1.3':'accounts_payable',
                        '6.1.4':'accounts_receivable',
                        '9.2.16':'address_clarity',
                        '9.2.17':'purpose_object',
                        '9.2.18':'#_min_stages',
                        '9.2.19':'#_max_stages',
                        '9.2.20':'object_area',
                        '9.2.21':'material_walls',
                        '9.2.22':'floor_material',
                        '9.2.23':'class_energy',
                        '9.2.24':'seism_resist',
                        '9.3.1':'living_sum_area',
                        '9.3.2':'nonliving_sum_area',
                        '11.1.1':'number_build_permission',
                        '11.1.2':'date_build_permission',
                        '11.1.3':'term_build_permission',
                        '11.1.4':'extention_date_permission',
                        '12.1.1':'type_dev_rights',
                        '12.3.1':'cadastral_number',
                        '12.3.2':'land_area',
                        '15.1.1':'#_livings',
                        '15.1.2':'#_nonlivings',
                        '15.1.2.1':'#_carplaces',
                        '15.1.2.2':'#_other_nonliving',
                        '17.1.1':'stage_building_implement',
                        '17.1.2':'planning_quarter_date',
                        '17.2.2':'planning_transfer_date',
                        '18.1.1':'planning_building_cost',
                        '19.1.1':'planning_ensure_oblig',
                        '19.2.2':'bank_escrow',
                        '19.6.1.4':'sum_of_loan',
                        '19.6.1.5':'limit_of_lending',
                        '19.6.1.7':'deadline_obligation',
                        '19.7.1.1.1.1':'living_escrow_number',
                        '19.7.1.1.1.2':'living_deduct_number',
                        '19.7.1.1.1.3':'living_others_number',
                        '19.7.1.1.2.1':'nonliving_escrow_number',
                        '19.7.1.1.2.2':'nonliving_deduct_number',
                        '19.7.1.1.2.3':'nonliving_others_number',
                        '19.7.1.1.3.1':'carplaces_escrow_number',
                        '19.7.1.1.3.2':'carplaces_deduct_number',
                        '19.7.1.1.3.3':'carplaces_others_number',
                        '19.7.2.1.1.1':'living_escrow_area',
                        '19.7.2.1.1.2':'living_deduct_area',
                        '19.7.2.1.1.3':'living_others_area',
                        '19.7.2.1.2.1':'nonliving_escrow_area',
                        '19.7.2.1.2.2':'nonliving_deduct_area',
                        '19.7.2.1.2.3':'nonliving_others_area',
                        '19.7.2.1.3.1':'carplaces_escrow_area',
                        '19.7.2.1.3.2':'carplaces_deduct_area',
                        '19.7.2.1.3.3':'carplaces_others_area',
                        '19.7.3.1.1.1':'living_escrow_sum',
                        '19.7.3.1.1.2':'living_deduct_sum',
                        '19.7.3.1.1.3':'living_others_sum',
                        '19.7.3.1.2.1':'nonliving_escrow_sum',
                        '19.7.3.1.2.2':'nonliving_deduct_sum',
                        '19.7.3.1.2.3':'nonliving_others_sum',
                        '19.7.3.1.3.1':'carplaces_escrow_sum',
                        '19.7.3.1.3.2':'carplaces_deduct_sum',
                        '19.7.3.1.3.3':'carplaces_others_sum',
                    }

exceptions = {
                '1.2.2':'Субъект Российской Федерации:',
                '1.2.3':'Район Субъекта Российской Федерации:',
                '1.2.4':'Вид населенного пункта:',
                '1.2.5':'Наименование населенного пункта:',
                '4.1.2':'Субъект Российской Федерации:',
                '4.1.3':'Район Субъекта Российской Федерации:',
                '4.1.4':'Вид населенного пункта:',
                '4.1.5':'Наименование населенного пункта:',
                '18.1.1':'Планируемая стоимость строительства:',
                '19.6.1.4':'Сумма кредита (займа) в соответствии с условиями договора:',
                '19.6.1.5':'Лимит кредитования в соответствии с условиями договора кредита (займа):',
                '19.6.1.7':'Cрок исполнения обязательств заемщика в полном размере в соответствии с договором кредита (займа):',
                '19.7.1.1.1.1':'Количество договоров, заключенных с использованием счетов эскроу:',
                '19.7.1.1.1.2':'Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.1.1.1.3':'Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.1.1.2.1':'Количество договоров, заключенных с использованием счетов эскроу:',
                '19.7.1.1.2.2':'Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.1.1.2.3':'Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.1.1.3.1':'Количество договоров, заключенных с использованием счетов эскроу:',
                '19.7.1.1.3.2':'Количество договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.1.1.3.3':'Количество договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.2.1.1.1':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:',
                '19.7.2.1.1.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.2.1.1.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.2.1.2.1':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:',
                '19.7.2.1.2.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.2.1.2.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.2.1.3.1':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием счетов эскроу:',
                '19.7.2.1.3.2':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.2.1.3.3':'Площадь объектов, в отношении которых договор участия в долевом строительстве заключен с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.3.1.1.1':'Суммарная цена договоров, заключенных с использованием счетов эскроу:',
                '19.7.3.1.1.2':'Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.3.1.1.3':'Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.3.1.2.1':'Суммарная цена договоров, заключенных с использованием счетов эскроу:',
                '19.7.3.1.2.2':'Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.3.1.2.3':'Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
                '19.7.3.1.3.1':'Суммарная цена договоров, заключенных с использованием счетов эскроу:',
                '19.7.3.1.3.2':'Суммарная цена договоров, заключенных при условии уплаты обязательных отчислений (взносов) в компенсационный фонд:',
                '19.7.3.1.3.3':'Суммарная цена договоров, заключенных с использованием иных способов обеспечения гражданской ответственности застройщика:',
            }